{
  "posts": [
    {
      "id": "1",
      "title": "json-server",
      "userId": 1
    },
    {
      "id": "2",
      "title": "json-server",
      "userId": 2
    }
  ],
  "articles": [
    {
      "id": "1",
      "title": "News",
      "subtitle": "ВСЕГО ХОРОШЕГО! ИМХО",
      "img": "https://risovach.ru/upload/2014/12/mem/udivlyonnyy-kot_68573964_orig_.jpg",
      "views": 1007,
      "createdAt": "13.09.2024",
      "userId": "1",
      "type": [
        "MEME"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragpaphs": [
            "dwFWfwenfweifjefnfeoufwlfnwo;ir3ofjmf3;4outh3fq/"
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "interface ArticleImageBlockComponentProps {\nclassName?: string;block: ArticleImageBlock"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragpaphs": [
            "Концепция ЭДО и безбумажного офиса обрела широкую популярность десятилетия назад. Время от времени появлялись устройства, которые считались «предвестниками цифрового офиса будущего». Казалось, что вскоре многие организационные процессы и документооборот станут цифровыми. Однако реализация концепции безбумажного офиса потребовала значительно больше времени."
          ]
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "<Button className={cls.copy}>\n<Icon Svg={CopyIcon}/>\n</Button>"
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://medialeaks.ru/wp-content/uploads/2017/09/breaking-news-6-600x338.jpg",
          "title": "Кот"
        }
      ]
    },
    {
      "id": "2",
      "title": "КОТО ТУСА",
      "subtitle": "ИМХО",
      "img": "https://memepedia.ru/wp-content/uploads/2017/09/%D1%81%D1%80%D0%BE%D1%87%D0%BD%D1%8B%D0%B5-%D0%BD%D0%BE%D0%B2%D0%BE%D1%81%D1%82%D0%B8-%D1%81-%D0%BA%D0%BE%D1%88%D0%BA%D0%B0%D0%BC%D0%B8.jpg",
      "views": 999,
      "createdAt": "18.09.2024",
      "userId": "2",
      "type": [
        "MEME"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "ПАТИ ПАТИ ПАТИ ЕЕЕЕЕЙ",
          "paragpaphs": [
            "Здесь должен быть какой-то текст, но я не знаю что писать, поэтому тут будет мемы котов"
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<body>\n  <h1>Заголовок</h1>\n  <!-- Комментарий -->\n  <p>Первый абзац.</p>\n  <p>Второй абзац.</p>\n</body>"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragpaphs": [
            "Ко́шка — домашнее животное, одно из наиболее популярных «животных-компаньонов». С точки зрения научной систематики, домашняя кошка — млекопитающее семейства кошачьих отряда хищных. Одни исследователи рассматривают домашнюю кошку как подвид дикой кошки, другие — как отдельный биологический вид."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "https://htmlbook.ru/files/images/samhtml/fig_1_01_01.png",
          "title": "КоД-LOL"
        }
      ]
    },
    {
      "id": "3",
      "title": "hook useState",
      "subtitle": "useState - это хук React, который позволяет вам добавить переменную состояния в ваш компонент.",
      "img": "https://avatars.dzeninfra.ru/get-zen_doc/10768392/pub_6508876a3129ee5d90d52f3a_65088dfd88601d1945309167/scale_1200",
      "views": 2005,
      "createdAt": "19.09.2024",
      "userId": "2",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "useState",
          "paragpaphs": [
            "..."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "const [state, setState] = useState(initialState);"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Описание",
          "paragpaphs": [
            "Вызовите useState на верхнем уровне вашего компонента, чтобы объявить переменную состояния."
          ]
        },
        {
          "id": "2",
          "type": "CODE",
          "code": "import { useState } from 'react';\n\nfunction MyComponent() {  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  // ...\n}"
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Параметры",
          "paragpaphs": [
            "initialState: Значение, которое вы хотите, чтобы состояние было первоначальным. Это может быть значение любого типа, но для функций предусмотрено особое поведение. Этот аргумент игнорируется после первоначального рендеринга."
          ]
        }
      ]
    },
    {
      "id": "4",
      "title": "hook useEffect",
      "subtitle": "Использование хука эффекта",
      "img": "https://static.mk.ru/upload/entities/2023/04/21/17/articles/detailPicture/f5/c5/f8/02/e8da0556f982f38306ad72689e3cae08.jpg",
      "views": 5632,
      "createdAt": "19.09.2023",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "useEffect",
          "paragpaphs": [
            "Хук эффекта даёт вам возможность выполнять побочные эффекты в функциональном компоненте:"
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "function Example() {\n  const [count, setCount] = useState(0);\n\n  useEffect(() => {\n  document.title = `Вы нажали ${count} раз`;\n\n  return (\n  <div> </div> \n );\n } });"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Описание",
          "paragpaphs": [
            "Этот фрагмент основан на примере со счётчиком из предыдущей страницы, только мы добавили новую функциональность: мы изменяем заголовок документа на пользовательское сообщение, которое также содержит количество нажатий кнопки.Побочными эффектами в React-компонентах могут быть: загрузка данных, оформление подписки и изменение DOM вручную. Неважно, называете ли вы эти операции «побочными эффектами» (или просто «эффектами») или нет, скорее всего вам доводилось ранее использовать их в своих компонентах."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Совет",
          "paragpaphs": [
            "Если вам знакомы классовые методы жизненного цикла React, хук useEffect представляет собой совокупность методов componentDidMount, componentDidUpdate, и componentWillUnmount.\n\n  Существует два распространённых вида побочных эффектов в компонентах React: компоненты, которые требуют и не требуют сброса. Давайте рассмотрим оба примера более детально."
          ]
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Эффекты без сброса",
          "paragpaphs": [
            "Иногда мы хотим выполнить дополнительный код после того, как React обновил DOM. Сетевые запросы, изменения DOM вручную, логирование — всё это примеры эффектов, которые не требуют сброса. После того, как мы запустили их, можно сразу забыть о них, ведь больше никаких дополнительных действий не требуется. Давайте сравним, как классы и хуки позволяют нам реализовывать побочные эффекты"
          ]
        }
      ]
    },
    {
      "id": "5",
      "title": "9 фактов о космосе, в которые трудно поверить",
      "subtitle": "В созвездии Рака есть планета-алмаз стоимостью $26,9 нониллионов, а земные сутки в будущем растянутся до 870 часов. Рассказываем, что еще необычного скрывает космос",
      "img": "https://d9c81ad3-85af-4ff6-8378-6038ea045e1b.akamaized.net/2021/04/kosmos-8.jpg",
      "views": 8244,
      "createdAt": "24.01.2024",
      "userId": "2",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "1. В Солнечной системе может быть больше восьми планет",
          "paragpaphs": [
            "Солнечная система — наиболее изученная часть космического пространства. По официальной версии, она включает восемь планет. В действительности их значительно больше. Одних только «карликов» здесь насчитывается не меньше пяти. Это Плутон, Церера, Хаумеа, Макемаке и Эрида. Из-за удаленности от Земли они мало изучены. Более того, по оценкам ученых, в Солнечной системе может находиться еще около 2 тыс. потенциальных карликовых планет. К тому же многие астрофизики признают наличие девятой крупной планеты. Она размером с Нептун и в десять раз тяжелее Земли. О существовании загадочной планеты X ученые стали догадываться еще в 2014 году, а в 2016-м получили первые доказательства с помощью компьютерного моделирования."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "2. Планета из графита и алмазов",
          "paragpaphs": [
            "Еще одну таинственную планету астрономы обнаружили в созвездии Рака. По мнению сотрудников Йельского университета, она вдвое больше и в восемь раз тяжелее Земли. Но главное — Янссен почти целиком состоит из графита и алмазов. Причем на долю последних приходится треть его вещества. Forbes оценил стоимость планеты в $26,9 нониллионов. По космическим меркам, гигантский алмаз расположен неподалеку от землян — всего в 40 световых годах. Правда, температура его поверхности достигает 2,148 тыс. градусов. А скорость вращения настолько высокая, что один год там равняется 18 земным часам. Кроме того, недавно ученые выяснили, что одна сторона Янссена находится в расплавленном состоянии и представляет собой углеродную лаву."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "3. Без Луны на Земле вымрут морские обитатели",
          "img": "https://s0.rbk.ru/v6_top_pics/media/img/7/46/755783416806467.jpg",
          "paragpaphs": [
            "Если спутник Земли исчезнет, скорее всего, глобальной катастрофы не случится. Когда-то она была основным источником света в темное время суток — теперь люди умеют обходиться без нее. И все же некоторые серьезные изменения произойдут. Например, настанет конец многим водным видам спорта. Фазы Луны влияют на волны — проходя над поверхностью нашей планеты, она «тянет» за собой массы воды. Кроме того, вымрут морские обитатели, жизнь которых напрямую связана с приливами и отливами. Без спутника на Земле не будет солнечных и лунных затмений, а тектонические плиты сместятся, вызвав землетрясения и извержения вулканов. Но главное — климат планеты уже не будет прежним."
          ]
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "4. Осколки Тунгусского метеорита до сих пор не найдены",
          "paragpaphs": [
            "Самый таинственный космический пришелец XX века — Тунгусский метеорит. Он упал в районе сибирской реки Тунгуска утром 30 июня 1908 года. В тот день небо осветило ярким сиянием, а последовавший за ним воздушный взрыв уничтожил огромный участок леса и выбил стекла домов в радиусе 200 км. Однако ни осколков метеорита, ни следов применения оружия массового поражения, ни обломков инопланетного корабля так никто и не нашел. По расчетам специалистов NASA, диаметр метеорита составлял 75 м, а сила взрыва сравнялась с мощностью термоядерной бомбы. К слову, после падения Челябинского метеорита ученые нашли более 100 осколков. Самый большой из них весит почти 700 кг."
          ]
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "5. В космосе царит тишина",
          "img": "https://s0.rbk.ru/v6_top_pics/media/img/2/00/755783416807002.jpg",
          "paragpaphs": [
            "Самым тихим местом на нашей планете считается безэховая камера в Лаборатории Орфилда — она поглощает до 99,99% звуков. Но даже там услышать абсолютную тишину не получится. Ее нарушит работа наших легких и кровеносной системы. Сегодня в этой лаборатории проводят различные исследования и тестируют приборы. А еще в подобных изолированных пространствах специалисты NASA испытывают будущих астронавтов. В космосе нет звуков — из-за отсутствия воздуха. Поэтому даже мощные галактические взрывы происходят в полной тишине. Работать в таких условиях очень трудно: всего несколько минут в звуковом вакууме вызывают у неподготовленных людей панические атаки и сильные слуховые галлюцинации."
          ]
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "6. Скафандр NASA стоит $22 млн",
          "img": "https://s0.rbk.ru/v6_top_pics/media/img/3/32/755783416807323.jpg",
          "paragpaphs": [
            "Первый выход в открытый космос команды женщин-космонавтов был перенесен из-за нехватки скафандров и состоялся в октябре 2019 года. В разработку новых скафандров NASA вложило более $200 млн. Несмотря на это, согласно отчету генерального инспектора Пола Мартина, в распоряжении ведомства находится всего 11 пригодных для эксплуатации космических костюмов. Они разработаны в конце семидесятых годов, а срок их службы истек еще в прошлом столетии. Из-за неполадок в устаревшей охлаждающей системе скафандров в шлемах астронавтов скапливается влага. По словам инженера NASA Пабло де Леона, каждый такой костюм весит более 150 кг и стоит $22 млн."
          ]
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "7. Луна покидает земную орбиту",
          "paragpaphs": [
            "Луна постепенно удаляется от нашей планеты. Правда, происходит это с очень незначительной скоростью — 38 мм в год. Исследователи из Висконсинского университета в Мэдисоне и Колумбийского университета рассчитали, что 1,5 млрд лет назад земные сутки длились примерно 18 часов. В то время Луна находилась к Земле на 44 тыс. км ближе, чем теперь. По мнению астрофизиков, возросшее расстояние повлияло на вращение планеты вокруг своей оси, а вместе с тем на климат и продолжительность дня. Еще через несколько миллиардов лет орбита Луны увеличится примерно вдвое, а сутки растянутся на 870 часов. Однако со временем они перестанут отдаляться друг от друга, и спутник вновь начнет двигаться к Земле, прогнозируют специалисты."
          ]
        },
        {
          "id": "8",
          "type": "TEXT",
          "title": "8. Мощное гравитационное поле замедляет время",
          "paragpaphs": [
            "Из-за гравитации время в космосе протекает по-разному. Чем мощнее гравитационное поле, тем сильнее замедляется время. Этот феномен проиллюстрирован в фильме «Интерстеллар» Кристофера Нолана. Когда герои попадают на планету Миллер, час для них оказывается равен семи земным годам. Вернувшись на борт космического корабля спустя три с небольшим часа, астронавты застают уже поседевшего коллегу, который ждал их возвращения долгие 23 года. Практически так же происходит и в реальности. Например, для космонавтов время тянется на доли секунды быстрее, чем для людей на Земле. А вблизи черной дыры оно почти полностью останавливается."
          ]
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "9. Ветра на Венере дуют со скоростью 500 км/ч",
          "paragpaphs": [
            "Венера схожа с Землей по составу и размерам, но сильно отличается по внешнему виду и условиям на поверхности. Атмосфера планеты состоит из нагретых до больших температур углекислого газа и паров серной кислоты и обладает очень высокой плотностью. Данные спектрометра SPICAV, установленного на орбитальной станции Venus Express, показали, что в мезосфере Венеры на высоте 85-100 км озона в 10 тыс. раз меньше, чем в атмосфере Земли. А содержание двуокиси серы значительно меняется в течение нескольких суток. Благодаря исследованию с использованием звездного просвечивания, когда спектрометр следил за звездами при их восходе и заходе за горизонт планеты, ученым удалось выяснить концентрацию основного газа венерианской атмосферы. Такое распределение озона указывает, что газ взаимодействует с химическими соединениями, которые ветры переносят из дневной стороны полушария на ночную. А из-за того, что атмосфера Венеры вращается в 60 раз быстрее поверхности планеты, скорость ветра здесь может составлять до 500 км/ч. "
          ]
        }
      ]
    },
    {
      "id": "6",
      "title": "C",
      "subtitle": "useState - это хук React, который позволяет вам добавить переменную состояния в ваш компонент.",
      "img": "https://ru.react.js.org/logo-og.png",
      "views": 662,
      "createdAt": "12.12.2022",
      "userId": "2",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "useState",
          "paragpaphs": [
            "..."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "const [state, setState] = useState(initialState);"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Описание",
          "paragpaphs": [
            "Вызовите useState на верхнем уровне вашего компонента, чтобы объявить переменную состояния."
          ]
        },
        {
          "id": "2",
          "type": "CODE",
          "code": "import { useState } from 'react';\n\nfunction MyComponent() {  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  // ...\n}"
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Параметры",
          "paragpaphs": [
            "initialState: Значение, которое вы хотите, чтобы состояние было первоначальным. Это может быть значение любого типа, но для функций предусмотрено особое поведение. Этот аргумент игнорируется после первоначального рендеринга."
          ]
        }
      ]
    },
    {
      "id": "7",
      "title": "D",
      "subtitle": "useState - это хук React, который позволяет вам добавить переменную состояния в ваш компонент.",
      "img": "https://ru.react.js.org/logo-og.png",
      "views": 6666,
      "createdAt": "19.02.2024",
      "userId": "2",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "useState",
          "paragpaphs": [
            "..."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "const [state, setState] = useState(initialState);"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Описание",
          "paragpaphs": [
            "Вызовите useState на верхнем уровне вашего компонента, чтобы объявить переменную состояния."
          ]
        },
        {
          "id": "2",
          "type": "CODE",
          "code": "import { useState } from 'react';\n\nfunction MyComponent() {  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  // ...\n}"
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Параметры",
          "paragpaphs": [
            "initialState: Значение, которое вы хотите, чтобы состояние было первоначальным. Это может быть значение любого типа, но для функций предусмотрено особое поведение. Этот аргумент игнорируется после первоначального рендеринга."
          ]
        }
      ]
    },
    {
      "id": "8",
      "title": "E",
      "subtitle": "useState - это хук React, который позволяет вам добавить переменную состояния в ваш компонент.",
      "img": "https://ru.react.js.org/logo-og.png",
      "views": 1116,
      "createdAt": "18.04.2022",
      "userId": "2",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "useState",
          "paragpaphs": [
            "..."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "const [state, setState] = useState(initialState);"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Описание",
          "paragpaphs": [
            "Вызовите useState на верхнем уровне вашего компонента, чтобы объявить переменную состояния."
          ]
        },
        {
          "id": "2",
          "type": "CODE",
          "code": "import { useState } from 'react';\n\nfunction MyComponent() {  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  // ...\n}"
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Параметры",
          "paragpaphs": [
            "initialState: Значение, которое вы хотите, чтобы состояние было первоначальным. Это может быть значение любого типа, но для функций предусмотрено особое поведение. Этот аргумент игнорируется после первоначального рендеринга."
          ]
        }
      ]
    },
    {
      "id": "9",
      "title": "E",
      "subtitle": "useState - это хук React, который позволяет вам добавить переменную состояния в ваш компонент.",
      "img": "https://ru.react.js.org/logo-og.png",
      "views": 7626,
      "createdAt": "22.02.2022",
      "userId": "2",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "useState",
          "paragpaphs": [
            "..."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "const [state, setState] = useState(initialState);"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Описание",
          "paragpaphs": [
            "Вызовите useState на верхнем уровне вашего компонента, чтобы объявить переменную состояния."
          ]
        },
        {
          "id": "2",
          "type": "CODE",
          "code": "import { useState } from 'react';\n\nfunction MyComponent() {  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  // ...\n}"
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Параметры",
          "paragpaphs": [
            "initialState: Значение, которое вы хотите, чтобы состояние было первоначальным. Это может быть значение любого типа, но для функций предусмотрено особое поведение. Этот аргумент игнорируется после первоначального рендеринга."
          ]
        }
      ]
    },
    {
      "id": "10",
      "title": "F",
      "subtitle": "useState - это хук React, который позволяет вам добавить переменную состояния в ваш компонент.",
      "img": "https://ru.react.js.org/logo-og.png",
      "views": 942,
      "createdAt": "10.09.2020",
      "userId": "2",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "useState",
          "paragpaphs": [
            "..."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "const [state, setState] = useState(initialState);"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Описание",
          "paragpaphs": [
            "Вызовите useState на верхнем уровне вашего компонента, чтобы объявить переменную состояния."
          ]
        },
        {
          "id": "2",
          "type": "CODE",
          "code": "import { useState } from 'react';\n\nfunction MyComponent() {  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  const [age, setAge] = useState(28);\n  // ...\n}"
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "Параметры",
          "paragpaphs": [
            "initialState: Значение, которое вы хотите, чтобы состояние было первоначальным. Это может быть значение любого типа, но для функций предусмотрено особое поведение. Этот аргумент игнорируется после первоначального рендеринга."
          ]
        }
      ]
    }
  ],
  "comments": [
    {
      "id": "1",
      "text": "some comment",
      "articleId": "1",
      "userId": "1"
    },
    {
      "id": "2",
      "text": "some comment 2",
      "articleId": "1",
      "userId": "1"
    },
    {
      "id": "3",
      "text": "some comment 3",
      "articleId": "1",
      "userId": "1"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "   vkefevverv",
      "id": "jhy8wo0"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "Я ТУТ!!!",
      "id": "qw9yzjC"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "ОДИН РАЗРАБ БУГАГАГАГА",
      "id": "vcVvvRt"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "проверкак",
      "id": "2F7ozV2"
    },
    {
      "articleId": "2",
      "userId": "2",
      "text": "где взять приглашение?",
      "id": "0AWZ3-h"
    },
    {
      "articleId": "5",
      "userId": "2",
      "text": "!",
      "id": "4HQQSL6"
    },
    {
      "articleId": "5",
      "userId": "2",
      "text": "проверка",
      "id": "QwLPBjV"
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "user123",
      "password": "123",
      "roles": ["USER"],
      "avatar": "https://i.pinimg.com/236x/c8/cc/24/c8cc24bba37a25c009647b8875aae0e3.jpg"
    },
    {
      "id": "2",
      "username": "kuros",
      "password": "777",
      "roles": ["ADMIN"],
      "avatar": "https://sun9-33.userapi.com/impg/JOZp_Q56GaXoxGie_jCooQyf7kT1Du5D0UVinQ/SIAs1hwSoWY.jpg?size=604x604&quality=96&sign=15ac6e5f64afaa38dacbfb42242bb239&type=album"
    },
    {
      "id": "3",
      "username": "manager",
      "password": "777",
      "roles": ["MANAGER"],
      "avatar": "https://sun9-33.userapi.com/impg/JOZp_Q56GaXoxGie_jCooQyf7kT1Du5D0UVinQ/SIAs1hwSoWY.jpg?size=604x604&quality=96&sign=15ac6e5f64afaa38dacbfb42242bb239&type=album"
    }
  ],
  "profile": [
    {
      "id": "1",
      "first": "Kuros",
      "lastName": "M",
      "age": 23,
      "currency": "EUR",
      "country": "Korea",
      "city": "Moscow",
      "username": "admin",
      "avatar": "https://i.pinimg.com/236x/c8/cc/24/c8cc24bba37a25c009647b8875aae0e3.jpg"
    },
    {
      "id": "2",
      "first": "Какаши",
      "lastName": "Хатаке",
      "age": 50,
      "currency": "EUR",
      "country": "Japan",
      "city": "Коноха",
      "username": "kuros",
      "avatar": "https://sun9-33.userapi.com/impg/JOZp_Q56GaXoxGie_jCooQyf7kT1Du5D0UVinQ/SIAs1hwSoWY.jpg?size=604x604&quality=96&sign=15ac6e5f64afaa38dacbfb42242bb239&type=album"
    }
  ]
}